Polish documentation and add diagrams
